Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/reference-react-dom_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: If you load React from a `<script>` tag, these top-level APIs are available on the `ReactDOM` global.
ja: `<script>` タグから React をロードすると、以下のトップレベル API をグローバル変数 `ReactDOM` で使用することができます。

source: If you use ES6 with npm, you can write `import ReactDOM from 'react-dom'`.
ja: npm と ES6 を使用している場合は、`import ReactDOM from 'react-dom'` と記述できます。

source: If you use ES5 with npm, you can write `var ReactDOM = require('react-dom')`.
ja: npm と ES5 を使用している場合は、`var ReactDOM = require('react-dom')` と記述できます。

source: ## Overview {#overview}
ja: ## 概要 {#overview}

source: The `react-dom` package provides DOM-specific methods that can be used at the top level of your app and as an escape hatch to get outside of the React model if you need to.
ja: `react-dom` パッケージには、DOM 固有のメソッドが用意されており、アプリケーションのトップレベルで使用したり、必要に応じて React モデルから外れるための避難ハッチとして使用できます。

source: Most of your components should not need to use this module.
ja: ほとんどのコンポーネントでは、このモジュールを使用する必要はないはずです。

source: ### Browser Support {#browser-support}
ja: ### ブラウザサポート {#browser-support}

source: React supports all popular browsers, including Internet Explorer 9 and above, although [some polyfills are required](/docs/javascript-environment-requirements.html) for older browsers such as IE 9 and IE 10.
ja: React は Internet Explorer 9 以降を含む全ての一般的なブラウザをサポートしていますが、IE 9 や IE 10 といった古いブラウザでは[いくつかのポリフィルが必要です](/docs/javascript-environment-requirements.html)。

source: > Note > > We don't support older browsers that don't support ES5 methods, but you may find that your apps do work in older browsers if polyfills such as [es5-shim and es5-sham](https://github.com/es-shims/es5-shim) are included in the page.
ja: > 補足 > > React は ES5 をサポートしていない古いブラウザをサポートしていませんが、ページ内に [es5-shim や es5-sham](https://github.com/es-shims/es5-shim) のようなポリフィルが含まれている場合、古いブラウザでもアプリケーションが動作することがあります。

source: You're on your own if you choose to take this path.
ja: この手段を選択するかどうかは自己責任で判断してください。

source: ## Reference {#reference}
ja: ## リファレンス {#reference}

source: Render a React element into the DOM in the supplied `container` and return a [reference](/docs/more-about-refs.html) to the component (or returns `null` for [stateless components](/docs/components-and-props.html#function-and-class-components)).
ja: 渡された `container` の DOM に React 要素をレンダーし、コンポーネントへの[参照](/docs/more-about-refs.html)（[ステートレスコンポーネント](/docs/components-and-props.html#function-and-class-components)の場合は `null`）を返します。

source: If the React element was previously rendered into `container`, this will perform an update on it and only mutate the DOM as necessary to reflect the latest React element.
ja: React 要素がすでに `container` にレンダーされている場合は更新を行い、最新の React 要素を反映するために必要な DOM のみを変更します。

source: If the optional callback is provided, it will be executed after the component is rendered or updated.
ja: オプションのコールバックが渡されている場合は、コンポーネントがレンダーまたは更新された後に実行されます。

source: > Note: > > `ReactDOM.render()` controls the contents of the container node you pass in.
ja: > 補足: > > `ReactDOM.render()` は与えられたコンテナの内容を制御します。

source: Any existing DOM elements inside are replaced when first called.
ja: コンテナ内部のあらゆる既存の DOM 要素は、最初に呼び出された時に置き換えられます。

source: Later calls use React’s DOM diffing algorithm for efficient updates.
ja: 後続する呼び出しでは効率的な更新のために React の DOM 差分アルゴリズムを使用します。

source: > > `ReactDOM.render()` does not modify the container node (only modifies the children of the container).
ja: > > `ReactDOM.render()` はコンテナノードを変更しません（コンテナの子要素のみ変更します）。

source: It may be possible to insert a component to an existing DOM node without overwriting the existing children.
ja: 既存の子要素を上書きせずにコンポーネントを既存の DOM ノードに挿入することが可能な場合があります。

source: > > `ReactDOM.render()` currently returns a reference to the root `ReactComponent` instance.
ja: > > `ReactDOM.render()` は現時点ではルートの `ReactComponent` インスタンスへの参照を返します。

source: However, using this return value is legacy > and should be avoided because future versions of React may render components asynchronously in some cases.
ja: > しかし、この戻り値を使用する方法は古く、将来のバージョンの React では一部のケースで非同期にコンポーネントをレンダーするようになる可能性があるため、使用は避けるべきです。

source: If you need a reference to the root `ReactComponent` instance, the preferred solution is to attach a > [callback ref](/docs/more-about-refs.html#the-ref-callback-attribute) to the root element.
ja: > ルートの `ReactComponent` インスタンスへの参照が必要な場合は、ルート要素に[コールバックの ref](/docs/more-about-refs.html#the-ref-callback-attribute) を追加することを推奨します。

source: > > Using `ReactDOM.render()` to hydrate a server-rendered container is deprecated and will be removed in React 17.
ja: > > サーバで描画されたコンテナをクライアントで再利用するために `ReactDOM.render()` を使用することは非推奨となり、React 17 では削除されます。

source: Use [`hydrate()`](#hydrate) instead.
ja: 代わりに [`hydrate()`](#hydrate) を使用してください。

source: Same as [`render()`](#render), but is used to hydrate a container whose HTML contents were rendered by [`ReactDOMServer`](/docs/react-dom-server.html).
ja: [`render()`](#render) と同様ですが、[`ReactDOMServer`](/docs/react-dom-server.html) により HTML コンテンツが描画されたコンテナをクライアントで再利用するために使用されます。

source: React will attempt to attach event listeners to the existing markup.
ja: React は既存のマークアップにイベントリスナをアタッチしようとします。

source: React expects that the rendered content is identical between the server and the client.
ja: React はレンダーされる内容が、サーバ・クライアント間で同一であることを期待します。

source: It can patch up differences in text content, but you should treat mismatches as bugs and fix them.
ja: React はテキストコンテンツの差異を修復することは可能ですが、その不一致はバグとして扱い、修正すべきです。

source: In development mode, React warns about mismatches during hydration.
ja: 開発用モードでは、React は両者のレンダーの不一致について警告します。

source: There are no guarantees that attribute differences will be patched up in case of mismatches.
ja: 不一致がある場合に属性の差異が修復されるという保証はありません。これはパフォーマンス上の理由から重要です。

source: This is important for performance reasons because in most apps, mismatches are rare, and so validating all markup would be prohibitively expensive.
ja: なぜなら、ほとんどのアプリケーションにおいて不一致が発生するということは稀であり、全てのマークアップを検証することは許容不可能なほど高コストになるためです。

source: If a single element's attribute or text content is unavoidably different between the server and the client (for example, a timestamp), you may silence the warning by adding `suppressHydrationWarning={true}` to the element.
ja: 単一要素の属性やテキストコンテンツがサーバ・クライアント間においてやむを得ず異なってしまう場合（例えばタイムスタンプなど）、要素に `suppressHydrationWarning={true}` を追加することで警告の発生を停止させることが可能です。

source: It only works one level deep, and is intended to be an escape hatch.
ja: それは 1 階層下の要素までで機能するものであり、また避難ハッチとして使われるものです。

source: Don't overuse it.
ja: そのため、多用しないでください。

source: Unless it's text content, React still won't attempt to patch it up, so it may remain inconsistent until future updates.
ja: テキストコンテンツでない限り、React は修復を試行しようとはしないため、将来の更新まで不整合が残る可能性があります。

source: If you intentionally need to render something different on the server and the client, you can do a two-pass rendering.
ja: サーバとクライアントで異なるものをレンダーしたい場合は、2 パスレンダーを使用できます。

source: Components that render something different on the client can read a state variable like `this.state.isClient`, which you can set to `true` in `componentDidMount()`.
ja: クライアント側で異なるものをレンダーするコンポーネントでは、`this.state.isClient` のような state 変数を読み込み、`componentDidMount()` で `true` を設定することができます。

source: This way the initial render pass will render the same content as the server, avoiding mismatches, but an additional pass will happen synchronously right after hydration.
ja: こうすると、最初のレンダーパスではサーバ側と同一の内容を描画して不一致を回避しますが、追加のパスが初回レンダーの直後に同期的に発生します。

source: Note that this approach will make your components slower because they have to render twice, so use it with caution.
ja: このアプローチでは 2 回レンダーが発生することによりコンポーネントのパフォーマンスが低下しますので、注意して使用してください。

source: Remember to be mindful of user experience on slow connections.
ja: 低速な接続下でのユーザ体験に留意することを忘れないでください。

source: The JavaScript code may load significantly later than the initial HTML render, so if you render something different in the client-only pass, the transition can be jarring.
ja: JavaScript のコードは初回の HTML の描画より大幅に遅れてロードされる可能性があるため、クライアントでのみ何か異なるものを描画した場合、その変化は不快感を与える可能性があります。

source: However, if executed well, it may be beneficial to render a "shell" of the application on the server, and only show some of the extra widgets on the client.
ja: しかしうまく実行されれば、サーバ上でアプリケーションの「外枠」を描画し、クライアント上でのみ追加のウィジェットを表示することは有益になるかもしれません。

source: To learn how to do this without getting the markup mismatch issues, refer to the explanation in the previous paragraph.
ja: マークアップの不一致の問題を発生させずにこれを実行する方法については、前の段落の説明をご参照ください。

source: Remove a mounted React component from the DOM and clean up its event handlers and state.
ja: DOM からマウントされた React コンポーネントを削除し、イベントハンドラや state をクリーンアップします。

source: If no component was mounted in the container, calling this function does nothing.
ja: コンテナにコンポーネントがマウントされていない場合、このメソッドを呼び出しても何も行いません。

source: Returns `true` if a component was unmounted and `false` if there was no component to unmount.
ja: コンポーネントがアンマウントされた場合は `true` を返し、アンマウントすべきコンポーネントが存在しなかった場合は `false` を返します。

source: > Note: > > `findDOMNode` is an escape hatch used to access the underlying DOM node.
ja: > 補足: > > `findDOMNode` は内在する DOM ノードにアクセスするために使用される避難ハッチです。

source: In most cases, use of this escape hatch is discouraged because it pierces the component abstraction.
ja: ほとんどのケースにおいて、この避難ハッチの使用はコンポーネントの抽象化に穴を開けてしまうためおすすめしません。[`StrictMode` では非推奨になっています。

source: [It has been deprecated in `StrictMode`.](/docs/strict-mode.html#warning-about-deprecated-finddomnode-usage)
ja: ](/docs/strict-mode.html#warning-about-deprecated-finddomnode-usage)

source: ```javascript ReactDOM.findDOMNode(component) ``` If this component has been mounted into the DOM, this returns the corresponding native browser DOM element.
ja: ```javascript ReactDOM.findDOMNode(component) ``` DOM にこのコンポーネントがマウントされている場合、このメソッドは対応するネイティブブラウザの DOM 要素を返します。

source: This method is useful for reading values out of the DOM, such as form field values and performing DOM measurements.
ja: このメソッドはフォームフィールドの値や DOM の大きさを計測するのに便利です。

source: **In most cases, you can attach a ref to the DOM node and avoid using `findDOMNode` at all.**
ja: **ほとんどのケースにおいて、DOM ノードに ref をアタッチすることで `findDOMNode` の使用を避けることができます。**

source: When a component renders to `null` or `false`, `findDOMNode` returns `null`.
ja: コンポーネントが `null` や `false` をレンダーする場合、`findDOMNode` は `null` を返します。

source: When a component renders to a string, `findDOMNode` returns a text DOM node containing that value.
ja: コンポーネントが文字列をレンダーする場合、`findDOMNode` はその値を含んだテキスト DOM ノードを返します。

source: As of React 16, a component may return a fragment with multiple children, in which case `findDOMNode` will return the DOM node corresponding to the first non-empty child.
ja: React 16 以降、コンポーネントは複数の子要素を含むフラグメントを返すことがありますが、その場合 `findDOMNode` は最初の空でない子要素に対応する DOM ノードを返します。

source: > Note: > > `findDOMNode` only works on mounted components (that is, components that have been placed in the DOM).
ja: > 補足: > > `findDOMNode` はマウントされたコンポーネントに対してのみ機能します（つまり、DOM に配置されたコンポーネント）。

source: If you try to call this on a component that has not been mounted yet (like calling `findDOMNode()` in `render()` on a component that has yet to be created) an exception will be thrown.
ja: まだマウントされていないコンポーネントにおいてこのメソッドを呼ぼうとする場合（まだ作成されていないコンポーネントにおける `render()` の中で `findDOMNode()` を呼びだす場合など）、例外がスローされます。

source: > > `findDOMNode` cannot be used on function components.
ja: > > `findDOMNode` は関数コンポーネントでは使用できません。

source: Creates a portal.
ja: ポータルを作成します。

source: Portals provide a way to [render children into a DOM node that exists outside the hierarchy of the DOM component](/docs/portals.html).
ja: ポータルは [DOM コンポーネントの階層の外側に存在している DOM ノードに対して子要素をレンダーする](/docs/portals.html)方法を提供します。
